Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.pro.status.footer
source: Your Pro entitlement is read from StoreKit and mirrored locally for feature gates.
ar: يتم قراءة استحقاق Pro من StoreKit وينعكس محليًا لبوابات الميزات.
de: Ihr Pro-Anspruch wird von StoreKit gelesen und lokal für Funktionsschalter gespiegelt.
es: Su derecho Pro se lee desde StoreKit y se refleja localmente para las funciones.
fr: Votre droit Pro est lu depuis StoreKit et reflété localement pour les fonctionnalités.
id: Hak Pro Anda dibaca dari StoreKit dan dicerminkan secara lokal untuk gerbang fitur.
it: Il tuo diritto Pro viene letto da StoreKit e replicato localmente per i controlli delle funzionalità.
ja: Pro の権限は StoreKit から読み取られ、機能制御のためにローカルにミラーリングされます。
ko: Pro 권한은 StoreKit에서 읽어오며, 기능 게이트를 위해 로컬에 미러링됩니다.
nl: Uw Pro-recht wordt uitgelezen uit StoreKit en lokaal gespiegeld voor functiecontrole.
pl: Uprawnienie Pro jest odczytywane z StoreKit i lokalnie synchronizowane dla bramek funkcji.
pt_br: Sua licença Pro é lida do StoreKit e espelhada localmente para controle de recursos.
ru: Ваши права Pro считываются из StoreKit и дублируются локально для проверки функций.
tr: Pro hakkınız StoreKit'ten okunur ve özellik kontrolleri için yerel olarak yansıtılır.
uk: Ваші права Pro зчитуються з StoreKit і дзеркально зберігаються локально для перевірки функцій.
vi: Quyền Pro của bạn được đọc từ StoreKit và sao chép cục bộ để kiểm soát tính năng.
zh_hans: Pro 权益来自 StoreKit，并同步到本地镜像用于功能门控。
zh_hant: 您的 Pro 權益從 StoreKit 讀取，並在本機鏡像以供功能開關使用。

# settings.pro.status.free
source: You are using the free plan.
ar: أنت تستخدم الخطة المجانية.
de: Sie nutzen den kostenlosen Tarif.
es: Está usando el plan gratuito.
fr: Vous utilisez le forfait gratuit.
id: Anda menggunakan paket gratis.
it: Stai utilizzando il piano gratuito.
ja: 無料プランをご利用中です。
ko: 무료 요금제를 사용 중입니다.
nl: U gebruikt het gratis abonnement.
pl: Korzystasz z darmowego planu.
pt_br: Você está usando o plano gratuito.
ru: Вы используете бесплатный план.
tr: Ücretsiz planı kullanıyorsunuz.
uk: Ви використовуєте безкоштовний план.
vi: Bạn đang sử dụng gói miễn phí.
zh_hans: 当前使用免费方案。
zh_hant: 您正在使用免費方案。

# settings.pro.subtitle.active
source: Pro is active. Your avatar shows the exclusive PRO badge.
ar: Pro نشط. يظهر رمزك الشخصي شارة PRO الحصرية.
de: Pro ist aktiv. Ihr Avatar zeigt das exklusive PRO-Abzeichen.
es: Pro está activo. Su avatar muestra la insignia PRO exclusiva.
fr: Pro est actif. Votre avatar affiche le badge PRO exclusif.
id: Pro aktif. Avatar Anda menampilkan lencana PRO eksklusif.
it: Pro è attivo. Il tuo avatar mostra il badge PRO esclusivo.
ja: Pro が有効です。アバターに限定の PRO バッジが表示されます。
ko: Pro가 활성화되었습니다. 아바타에 독점 PRO 배지가 표시됩니다.
nl: Pro is actief. Uw avatar toont de exclusieve PRO-badge.
pl: Pro jest aktywne. Twój awatar ma ekskluzywną odznakę PRO.
pt_br: Pro ativo. Seu avatar exibe o selo exclusivo PRO.
ru: Pro активен. Ваш аватар показывает эксклюзивный значок PRO.
tr: Pro aktif. Avatarınızda özel PRO rozeti görünür.
uk: Pro активний. Ваш аватар має ексклюзивний значок PRO.
vi: Pro đang hoạt động. Hình đại diện của bạn hiển thị huy hiệu PRO độc quyền.
zh_hans: 已开通 Pro，头像会显示专属 PRO 标识。
zh_hant: Pro 已啟用。您的頭像會顯示專屬 PRO 徽章。

# settings.pro.subtitle.preview
source: Subscribe to unlock Pro features for AI, search, release tracking, and higher local limits.
ar: اشترك لفتح ميزات Pro للذكاء الاصطناعي والبحث وتتبع الإصدارات وحدود محلية أعلى.
de: Abonnieren Sie, um Pro-Funktionen für KI, Suche, Release-Verfolgung und höhere lokale Grenzen freizuschalten.
es: Suscríbase para desbloquear funciones Pro para IA, búsqueda, seguimiento de versiones y límites locales más altos.
fr: Abonnez-vous pour débloquer les fonctionnalités Pro pour l'IA, la recherche, le suivi des versions et des limites locales plus élevées.
id: Berlangganan untuk membuka fitur Pro untuk AI, pencarian, pelacakan rilis, dan batas lokal yang lebih tinggi.
it: Abbonati per sbloccare le funzionalità Pro per AI, ricerca, monitoraggio delle release e limiti locali più elevati.
ja: 登録して、AI、検索、リリース追跡、およびより高いローカル制限の Pro 機能をアンロックしてください。
ko: 구독하여 AI, 검색, 릴리스 추적 및 로컬 제한 상향 등 Pro 기능을 잠금 해제하세요.
nl: Abonneer om Pro-functies te ontgrendelen voor AI, zoeken, release-tracking en hogere lokale limieten.
pl: Subskrybuj, aby odblokować funkcje Pro dla AI, wyszukiwania, śledzenia wydań i wyższych limitów lokalnych.
pt_br: Assine para desbloquear recursos Pro de IA, busca, acompanhamento de lançamentos e limites locais maiores.
ru: Подпишитесь, чтобы разблокировать функции Pro для ИИ, поиска, отслеживания релизов и более высоких локальных лимитов.
tr: Yapay zeka, arama, sürüm takibi ve daha yüksek yerel sınırlar için Pro özelliklerini etkinleştirmek üzere abone olun.
uk: Підпишіться, щоб отримати функції Pro для ШІ, пошуку, відстеження релізів та вищих локальних лімітів.
vi: Đăng ký để mở khóa các tính năng Pro cho AI, tìm kiếm, theo dõi bản phát hành và giới hạn cục bộ cao hơn.
zh_hans: 订阅后解锁 AI、搜索、Release 追踪与更高本地额度。
zh_hant: 訂閱以解鎖 AI、搜尋、版本追蹤及更高的本機限制等 Pro 功能。

# settings.rag.backends.apiKey
source: API Key (optional for local services)
ar: مفتاح API (اختياري للخدمات المحلية)
de: API-Schlüssel (optional für lokale Dienste)
es: Clave API (opcional para servicios locales)
fr: Clé API (optionnelle pour les services locaux)
id: Kunci API (opsional untuk layanan lokal)
it: Chiave API (opzionale per servizi locali)
ja: API キー（ローカルサービスの場合はオプション）
ko: API 키 (로컬 서비스의 경우 선택 사항)
nl: API-sleutel (optioneel voor lokale diensten)
pl: Klucz API (opcjonalny dla usług lokalnych)
pt_br: Chave de API (opcional para serviços locais)
ru: API-ключ (необязательно для локальных сервисов)
tr: API Anahtarı (yerel hizmetler için isteğe bağlı)
uk: Ключ API (необов'язково для локальних сервісів)
vi: Khóa API (tùy chọn cho dịch vụ cục bộ)
zh_hans: API Key（本地服务可留空）
zh_hant: API 金鑰（本機服務可留空）

# settings.rag.backends.collection
source: Collection
ar: المجموعة
de: Sammlung
es: Colección
id: Koleksi
it: Collezione
ja: コレクション
ko: 컬렉션
nl: Collectie
pl: Kolekcja
pt_br: Coleção
ru: Коллекция
tr: Koleksiyon
uk: Колекція
vi: Bộ sưu tập
zh_hant: 集合

# settings.rag.backends.connectionSuccess
source: Connection succeeded and credentials were saved.
ar: نجح الاتصال وتم حفظ بيانات الاعتماد.
de: Verbindung erfolgreich und Anmeldedaten gespeichert.
es: Conexión exitosa y credenciales guardadas.
fr: Connexion réussie et identifiants enregistrés.
id: Koneksi berhasil dan kredensial disimpan.
it: Connessione riuscita e credenziali salvate.
ja: 接続に成功し、認証情報が保存されました。
ko: 연결 성공, 자격 증명이 저장되었습니다.
nl: Verbinding geslaagd en inloggegevens opgeslagen.
pl: Połączenie powiodło się, a dane logowania zostały zapisane.
pt_br: Conexão bem-sucedida e credenciais salvas.
ru: Подключение выполнено успешно, учётные данные сохранены.
tr: Bağlantı başarılı ve kimlik bilgileri kaydedildi.
uk: З'єднання встановлено, облікові дані збережено.
vi: Kết nối thành công và thông tin xác thực đã được lưu.
zh_hans: 连接成功，凭据已保存。
zh_hant: 連線成功，憑證已儲存。

# settings.rag.backends.endpoint
source: Endpoint
ar: نقطة النهاية
de: Endpunkt
fr: Point d'accès
ja: エンドポイント
ko: 엔드포인트
nl: Eindpunt
pl: Punkt końcowy
ru: Конечная точка
tr: Uç Nokta
uk: Кінцева точка
vi: Điểm cuối
zh_hant: 端點

# settings.rag.backends.fallback
source: Fall back to SQLite when an external backend is unavailable
ar: الرجوع إلى SQLite عند عدم توفر الخلفية الخارجية
de: Auf SQLite zurückfallen, wenn ein externes Backend nicht verfügbar ist
es: Usar SQLite como respaldo cuando un backend externo no esté disponible
fr: Revenir à SQLite lorsqu'un backend externe est indisponible
id: Gunakan SQLite sebagai cadangan jika backend eksternal tidak tersedia
it: Ripiega su SQLite quando un backend esterno non è disponibile
ja: 外部バックエンドが利用できない場合に SQLite にフォールバック
ko: 외부 백엔드를 사용할 수 없을 때 SQLite로 대체
nl: Terugvallen op SQLite wanneer een externe backend niet beschikbaar is
pl: Przełącz na SQLite, gdy zewnętrzny backend jest niedostępny
pt_br: Usar SQLite como fallback quando o backend externo estiver indisponível
ru: Использовать SQLite, если внешний бэкенд недоступен
tr: Harici bir arka uç kullanılamadığında SQLite'a geri dön
uk: Переходити на SQLite, якщо зовнішній бекенд недоступний
vi: Dự phòng sang SQLite khi backend bên ngoài không khả dụng
zh_hans: 外部后端不可用时回退 SQLite
zh_hant: 外部後端無法使用時回退至 SQLite

# settings.rag.backends.index
source: Index
ar: الفهرس
es: Índice
id: Indeks
it: Indice
ja: インデックス
ko: 인덱스
pl: Indeks
pt_br: Índice
ru: Индекс
tr: Dizin
uk: Індекс
vi: Chỉ mục
zh_hant: 索引

# settings.rag.backends.keyword
source: Keyword search
ar: بحث بالكلمات المفتاحية
de: Stichwortsuche
es: Búsqueda por palabras clave
fr: Recherche par mot-clé
id: Pencarian kata kunci
it: Ricerca per parole chiave
ja: キーワード検索
ko: 키워드 검색
nl: Trefwoordzoekopdracht
pl: Wyszukiwanie słów kluczowych
pt_br: Busca por palavra-chave
ru: Поиск по ключевым словам
tr: Anahtar kelime araması
uk: Пошук за ключовими словами
vi: Tìm kiếm từ khóa
zh_hans: 关键词检索
zh_hant: 關鍵字搜尋

# settings.rag.backends.rebuildRequired
source: Rebuild the RAG index to synchronize the selected backend.
ar: أعد بناء فهرس RAG لمزامنة الخلفية المحددة.
de: RAG-Index neu aufbauen, um das ausgewählte Backend zu synchronisieren.
es: Reconstruya el índice RAG para sincronizar el backend seleccionado.
fr: Reconstruire l'index RAG pour synchroniser le backend sélectionné.
id: Bangun ulang indeks RAG untuk menyinkronkan backend yang dipilih.
it: Ricostruisci l'indice RAG per sincronizzare il backend selezionato.
ja: RAG インデックスを再構築して、選択したバックエンドと同期します。
ko: 선택한 백엔드와 동기화하려면 RAG 인덱스를 다시 빌드하세요.
nl: Bouw de RAG-index opnieuw om de geselecteerde backend te synchroniseren.
pl: Przebuduj indeks RAG, aby zsynchronizować wybrany backend.
pt_br: Reconstrua o índice RAG para sincronizar com o backend selecionado.
ru: Перестройте индекс RAG для синхронизации с выбранным бэкендом.
tr: Seçilen arka ucu senkronize etmek için RAG dizinini yeniden oluşturun.
uk: Перебудуйте індекс RAG, щоб синхронізувати вибраний бекенд.
vi: Xây dựng lại chỉ mục RAG để đồng bộ hóa backend đã chọn.
zh_hans: 请重建 RAG 索引以同步新选择的后端。
zh_hant: 請重建 RAG 索引以同步所選後端。

# settings.rag.backends.section
source: RAG Backends
ar: خلفيات RAG
es: Backends RAG
fr: Backends RAG
id: Backend RAG
it: Backend RAG
ja: RAG バックエンド
ko: RAG 백엔드
pl: Backendy RAG
pt_br: Backends RAG
ru: Бэкенды RAG
tr: RAG Arka Uçları
uk: Бекенди RAG
vi: Backend RAG
zh_hans: RAG 后端
zh_hant: RAG 後端

# settings.rag.backends.testAndSave
source: Test and Save
ar: اختبار وحفظ
de: Testen und Speichern
es: Probar y Guardar
fr: Tester et enregistrer
id: Uji dan Simpan
it: Testa e salva
ja: テストして保存
ko: 테스트 및 저장
nl: Testen en opslaan
pl: Testuj i zapisz
pt_br: Testar e Salvar
ru: Проверить и сохранить
tr: Test Et ve Kaydet
uk: Перевірити та зберегти
vi: Kiểm tra và Lưu
zh_hans: 测试并保存
zh_hant: 測試並儲存

# settings.rag.backends.vector
source: Vector search
ar: بحث متجه
de: Vektorsuche
es: Búsqueda vectorial
fr: Recherche vectorielle
id: Pencarian vektor
it: Ricerca vettoriale
ja: ベクトル検索
ko: 벡터 검색
nl: Vectorzoekopdracht
pl: Wyszukiwanie wektorowe
pt_br: Busca vetorial
ru: Векторный поиск
tr: Vektör araması
uk: Векторний пошук
vi: Tìm kiếm vector
zh_hans: 向量检索
zh_hant: 向量搜尋

# settings.rag.backends.vectorName
source: Vector name
ar: اسم المتجه
de: Vektorname
es: Nombre del vector
fr: Nom du vecteur
id: Nama vektor
it: Nome vettore
ja: ベクトル名
ko: 벡터 이름
nl: Vectornaam
pl: Nazwa wektora
pt_br: Nome do vetor
ru: Имя вектора
tr: Vektör adı
uk: Назва вектора
vi: Tên vector
zh_hans: Vector 名称
zh_hant: 向量名稱

# settings.rag.index.chunksFormat
source: Embedding chunks %d / %d
ar: أجزاء التضمين %d / %d
de: Einbettungs-Chunks %d / %d
es: Fragmentos de embedding %d / %d
fr: Fragments d'incorporation %d / %d
id: Memproses chunk embedding %d / %d
it: Chunk di embedding %d / %d
ja: 埋め込みチャンク %d / %d
ko: 임베딩 청크 %d / %d
pl: Fragmenty osadzeń %d / %d
pt_br: Chunks de embedding %d / %d
ru: Чанки эмбеддингов %d / %d
tr: Gömme parçaları %d / %d
uk: Фрагменти вбудовування %d / %d
vi: Nhúng chunk %d / %d
zh_hans: 正在向量化分片 %d / %d
zh_hant: 正在嵌入區塊 %d / %d

# settings.rag.index.idle
source: RAG index is idle
ar: فهرس RAG خامل
de: RAG-Index ist inaktiv
es: El índice RAG está inactivo
fr: L'index RAG est inactif
id: Indeks RAG dalam keadaan idle
it: Indice RAG inattivo
ja: RAG インデックスはアイドル状態
ko: RAG 인덱스가 대기 중입니다
nl: RAG-index is inactief
pl: Indeks RAG jest bezczynny
pt_br: Índice RAG ocioso
ru: Индекс RAG неактивен
tr: RAG dizini boşta
uk: Індекс RAG неактивний
vi: Chỉ mục RAG đang nghỉ
zh_hans: RAG 索引空闲
zh_hant: RAG 索引閒置中

# settings.rag.index.pause
source: Pause
ar: إيقاف مؤقت
es: Pausa
id: Jeda
it: Pausa
ja: 一時停止
ko: 일시 정지
nl: Pauzeren
pl: Wstrzymaj
pt_br: Pausar
ru: Пауза
tr: Duraklat
uk: Пауза
vi: Tạm dừng
zh_hans: 暂停
zh_hant: 暫停

# settings.rag.index.readmesFormat
source: Fetching README %d / %d
ar: جلب README %d / %d
de: Hole README %d / %d
es: Obteniendo README %d / %d
fr: Récupération du README %d / %d
id: Mengambil README %d / %d
it: Recupero README %d / %d
ja: README を取得中 %d / %d
ko: README 가져오는 중 %d / %d
nl: README ophalen %d / %d
pl: Pobieranie README %d / %d
pt_br: Buscando README %d / %d
ru: Загрузка README %d / %d
tr: README getiriliyor %d / %d
uk: Отримання README %d / %d
vi: Đang tải README %d / %d
zh_hans: 正在补齐 README %d / %d
zh_hant: 正在擷取 README %d / %d

# settings.rag.index.readyFormat
source: %d chunks ready
ar: %d جزء جاهز
de: %d Chunks bereit
es: %d fragmentos listos
fr: %d fragments prêts
id: %d chunk siap
it: %d chunk pronti
ja: %d チャンク準備完了
ko: %d개 청크 준비됨
nl: %d chunks gereed
pl: %d fragmentów gotowych
pt_br: %d chunks prontos
ru: %d чанков готово
tr: %d parça hazır
uk: %d фрагментів готово
vi: %d chunk đã sẵn sàng
zh_hans: %d 个分片可用
zh_hant: %d 個區塊就緒

# settings.rag.index.rebuild
source: Rebuild
ar: إعادة بناء
de: Neu aufbauen
es: Reconstruir
fr: Reconstruire
id: Bangun Ulang
it: Ricostruisci
ja: 再構築
ko: 다시 빌드
nl: Opnieuw opbouwen
pl: Przebuduj
pt_br: Reconstruir
ru: Перестроить
tr: Yeniden Oluştur
uk: Перебудувати
vi: Xây dựng lại
zh_hans: 重建
zh_hant: 重建

# settings.rag.index.reposFormat
source: Building repositories %d / %d
ar: بناء المستودعات %d / %d
de: Erstelle Repositories %d / %d
es: Construyendo repositorios %d / %d
fr: Construction des dépôts %d / %d
id: Membangun repositori %d / %d
it: Costruzione repository %d / %d
ja: リポジトリを構築中 %d / %d
ko: 저장소 구축 중 %d / %d
nl: Repositories bouwen %d / %d
pl: Budowanie repozytoriów %d / %d
pt_br: Construindo repositórios %d / %d
ru: Сборка репозиториев %d / %d
tr: Depolar oluşturuluyor %d / %d
uk: Побудова репозиторіїв %d / %d
vi: Đang xây dựng kho lưu trữ %d / %d
zh_hans: 正在处理仓库 %d / %d
zh_hant: 正在建立儲存庫 %d / %d

# settings.services.apiKey
source: API Key
ar: مفتاح API
de: API-Schlüssel
es: Clave API
fr: Clé API
id: Kunci API
it: Chiave API
ja: API キー
ko: API 키
nl: API-sleutel
pl: Klucz API
pt_br: Chave de API
ru: API-ключ
tr: API Anahtarı
uk: Ключ API
vi: Khóa API
zh_hant: API 金鑰

# settings.services.apiKey.hide
source: Hide API key
ar: إخفاء مفتاح API
de: API-Schlüssel ausblenden
es: Ocultar clave API
fr: Masquer la clé API
id: Sembunyikan kunci API
it: Nascondi chiave API
ja: API キーを隠す
ko: API 키 숨기기
nl: API-sleutel verbergen
pl: Ukryj klucz API
pt_br: Ocultar chave de API
ru: Скрыть API-ключ
tr: API anahtarını gizle
uk: Приховати ключ API
vi: Ẩn khóa API
zh_hans: 遮蔽 API Key
zh_hant: 隱藏 API 金鑰

# settings.services.apiKey.placeholder
source: Leave empty to use the default
ar: اتركه فارغًا لاستخدام الافتراضي
de: Leer lassen, um den Standard zu verwenden
es: Déjelo vacío para usar el valor predeterminado
fr: Laissez vide pour utiliser la valeur par défaut
id: Kosongkan untuk menggunakan bawaan
it: Lascia vuoto per usare il valore predefinito
ja: 空のままにするとデフォルトを使用
ko: 비워두면 기본값 사용
nl: Laat leeg om de standaard te gebruiken
pl: Pozostaw puste, aby użyć domyślnego
pt_br: Deixe em branco para usar o padrão
ru: Оставьте пустым для использования по умолчанию
tr: Varsayılanı kullanmak için boş bırakın
uk: Залиште порожнім, щоб використовувати стандартний
vi: Để trống để sử dụng mặc định
zh_hans: 留空使用默认服务
zh_hant: 留空以使用預設值

# settings.services.apiKey.reveal
source: Show API key
ar: إظهار مفتاح API
de: API-Schlüssel anzeigen
es: Mostrar clave API
fr: Afficher la clé API
id: Tampilkan kunci API
it: Mostra chiave API
ja: API キーを表示
ko: API 키 표시
nl: API-sleutel tonen
pl: Pokaż klucz API
pt_br: Mostrar chave de API
ru: Показать API-ключ
tr: API anahtarını göster
uk: Показати ключ API
vi: Hiện khóa API
zh_hans: 明文显示 API Key
zh_hant: 顯示 API 金鑰

# settings.services.discovery.description
source: Provides Explore feeds, popular rankings, and new release rankings.
ar: يوفر خلاصات الاستكشاف والترتيب الشائع وترتيب الإصدارات الجديدة.
de: Stellt Explore-Feeds, Beliebtheits-Rankings und Neuveröffentlichungs-Rankings bereit.
es: Proporciona feeds de Explorar, clasificaciones populares y clasificaciones de nuevos lanzamientos.
fr: Fournit les flux Explorer, les classements populaires et les classements des nouvelles versions.
id: Menyediakan feed Jelajahi, peringkat populer, dan peringkat rilis baru.
it: Fornisce feed Esplora, classifiche popolari e classifiche delle nuove release.
ja: Explore フィード、人気ランキング、新着リリースランキングを提供します。
ko: 탐색 피드, 인기 순위, 새 릴리스 순위를 제공합니다.
nl: Biedt Ontdek-feeds, populaire ranglijsten en ranglijsten van nieuwe releases.
pl: Dostarcza kanały Odkrywaj, popularne rankingi i rankingi nowych wydań.
pt_br: Fornece feeds do Explorar, rankings populares e rankings de novos lançamentos.
ru: Предоставляет ленты «Исследовать», популярные рейтинги и рейтинги новых релизов.
tr: Keşfet akışları, popüler sıralamalar ve yeni sürüm sıralamaları sağlar.
uk: Надає стрічку Explore, популярні рейтинги та рейтинги нових релізів.
vi: Cung cấp nguồn cấp dữ liệu Khám phá, bảng xếp hạng phổ biến và bảng xếp hạng bản phát hành mới.
zh_hans: 提供探索发现流、热门榜单和新发布榜单。
zh_hant: 提供探索動態、熱門排名及新版本排名。

# settings.services.discovery.title
source: Discovery API
ar: API الاكتشاف
es: API de Descubrimiento
fr: API Discovery
id: API Discovery
it: API Discovery
pl: API Odkrywania
pt_br: API de Descoberta
tr: Keşif API'si
uk: API Discovery
vi: API Khám phá
zh_hans: 探索 API
zh_hant: 探索 API

# settings.services.effective
source: In effect: %@
ar: ساري: %@
de: Aktiv: %@
es: En vigor: %@
fr: En vigueur : %@
id: Berlaku: %@
it: In uso: %@
ja: 有効: %@
ko: 적용 중: %@
nl: Van kracht: %@
pl: Obowiązuje: %@
pt_br: Em vigor: %@
ru: Действует: %@
tr: Geçerli: %@
uk: Діє: %@
vi: Đang áp dụng: %@
zh_hans: 当前生效：%@
zh_hant: 目前生效：%@

# settings.services.effective.builtin
source: In effect: Built-in service
ar: ساري: الخدمة المدمجة
de: Aktiv: Integrierter Dienst
es: En vigor: Servicio integrado
fr: En vigueur : Service intégré
id: Berlaku: Layanan bawaan
it: In uso: Servizio integrato
ja: 有効: 組み込みサービス
ko: 적용 중: 내장 서비스
nl: Van kracht: Ingebouwde dienst
pl: Obowiązuje: usługa wbudowana
pt_br: Em vigor: Serviço integrado
ru: Действует: Встроенный сервис
tr: Geçerli: Yerleşik hizmet
uk: Діє: Вбудований сервіс
vi: Đang áp dụng: Dịch vụ tích hợp sẵn
zh_hans: 当前生效：内置服务
zh_hant: 當前生效：內建服務

# settings.services.error.invalidFormat
source: Invalid URL format.
ar: تنسيق URL غير صالح.
de: Ungültiges URL-Format.
es: Formato de URL no válido.
fr: Format d'URL invalide.
id: Format URL tidak valid.
it: Formato URL non valido.
ja: 無効なURL形式です。
ko: 잘못된 URL 형식입니다.
nl: Ongeldige URL-indeling.
pl: Nieprawidłowy format URL.
pt_br: Formato de URL inválido.
ru: Неверный формат URL.
tr: Geçersiz URL biçimi.
uk: Неправильний формат URL.
vi: Định dạng URL không hợp lệ.
zh_hans: URL 格式不正确。
zh_hant: URL 格式不正確。

# settings.services.error.invalidScheme
source: URL must start with http:// or https://
ar: يجب أن يبدأ URL بـ http:// أو https://
de: URL muss mit http:// oder https:// beginnen
es: La URL debe comenzar con http:// o https://
fr: L'URL doit commencer par http:// ou https://
id: URL harus diawali dengan http:// atau https://
it: L'URL deve iniziare con http:// o https://
ja: URLは http:// または https:// で始まる必要があります。
ko: URL은 http:// 또는 https://로 시작해야 합니다.
nl: URL moet beginnen met http:// of https://
pl: URL musi zaczynać się od http:// lub https://
pt_br: A URL deve começar com http:// ou https://
ru: URL должен начинаться с http:// или https://
tr: URL http:// veya https:// ile başlamalıdır
uk: URL має починатися з http:// або https://
vi: URL phải bắt đầu bằng http:// hoặc https://
zh_hans: URL 必须以 http:// 或 https:// 开头。
zh_hant: URL 必須以 http:// 或 https:// 開頭

# settings.services.error.missingHost
source: URL is missing a host.
ar: يفتقد URL المضيف.
de: URL hat keinen Host.
es: Falta el host en la URL.
fr: L'URL n'a pas d'hôte.
id: URL tidak memiliki host.
it: All'URL manca un host.
ja: URLにホストがありません。
ko: URL에 호스트가 없습니다.
nl: URL mist een host.
pl: Brak hosta w URL.
pt_br: A URL não possui um host.
ru: В URL отсутствует хост.
tr: URL'de ana makine eksik.
uk: У URL відсутній хост.
vi: URL thiếu máy chủ.
zh_hans: URL 缺少 host 部分。
zh_hant: URL 缺少主機位址。

# settings.services.health.ok
source: Reachable
ar: يمكن الوصول إليه
de: Erreichbar
es: Alcanzable
fr: Accessible
id: Dapat dijangkau
it: Raggiungibile
ja: 到達可能
ko: 연결 가능
nl: Bereikbaar
pl: Osiągalny
pt_br: Acessível
ru: Доступен
tr: Ulaşılabilir
uk: Доступний
vi: Có thể truy cập
zh_hans: 可达
zh_hant: 可連線

# settings.services.health.serverError
source: Server error
ar: خطأ في الخادم
de: Serverfehler
es: Error del servidor
fr: Erreur serveur
id: Kesalahan server
it: Errore del server
ja: サーバーエラー
ko: 서버 오류
nl: Serverfout
pl: Błąd serwera
pt_br: Erro do servidor
ru: Ошибка сервера
tr: Sunucu hatası
uk: Помилка сервера
vi: Lỗi máy chủ
zh_hans: 服务器错误
zh_hant: 伺服器錯誤

# settings.services.health.serviceMismatch
source: Service verification failed
ar: فشل التحقق من الخدمة
de: Dienstüberprüfung fehlgeschlagen
es: Verificación del servicio fallida
fr: Échec de la vérification du service
id: Verifikasi layanan gagal
it: Verifica del servizio fallita
ja: サービス検証に失敗しました
ko: 서비스 확인 실패
nl: Dienstverificatie mislukt
pl: Weryfikacja usługi nie powiodła się
pt_br: Falha na verificação do serviço
ru: Не удалось проверить сервис
tr: Hizmet doğrulaması başarısız
uk: Помилка перевірки сервісу
vi: Xác minh dịch vụ thất bại
zh_hans: 服务验证失败
zh_hant: 服務驗證失敗

# settings.services.health.unauthorized
source: API Key invalid
ar: مفتاح API غير صالح
de: API-Schlüssel ungültig
es: Clave API no válida
fr: Clé API invalide
id: Kunci API tidak valid
it: Chiave API non valida
ja: APIキーが無効です
ko: API 키가 유효하지 않음
nl: API-sleutel ongeldig
pl: Nieprawidłowy klucz API
pt_br: Chave de API inválida
ru: Неверный API-ключ
tr: API Anahtarı geçersiz
uk: Недійсний ключ API
vi: Khóa API không hợp lệ
zh_hans: API Key 无效
zh_hant: API Key 無效

# settings.services.health.unreachable
source: Unreachable
ar: لا يمكن الوصول إليه
de: Nicht erreichbar
es: Inalcanzable
fr: Inaccessible
id: Tidak dapat dijangkau
it: Irraggiungibile
ja: 到達不能
ko: 연결 불가
nl: Onbereikbaar
pl: Nieosiągalny
pt_br: Inacessível
ru: Недоступен
tr: Ulaşılamaz
uk: Недоступний
vi: Không thể truy cập
zh_hans: 不可达
zh_hant: 無法連線

# settings.services.health.versionSuffixFormat
source: , Version: %@
ar: ، الإصدار: %@
es: , Versión: %@
id: , Versi: %@
it: , Versione: %@
ja: 、バージョン: %@
ko: , 버전: %@
nl: , Versie: %@
pl: , Wersja: %@
pt_br: , Versão: %@
ru: , Версия: %@
tr: , Sürüm: %@
uk: , Версія: %@
vi: , Phiên bản: %@
zh_hans: , 版本号: %@
zh_hant: ，版本：%@
